RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6280/hpm_sysctl_regs.h
/*
 * HALT (RW)
 *
 * halt request for CPU0,
 * 0: CPU0 will start to execute after reset or receive wakeup request
 * 1: CPU0 will not start after reset, or wakeup after WFI
 */
#define SYSCTL_CPU_LP_HALT_MASK (0x10000UL)
#define SYSCTL_CPU_LP_HALT_SHIFT (16U)
#define SYSCTL_CPU_LP_HALT_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_HALT_SHIFT) & SYSCTL_CPU_LP_HALT_MASK)
#define SYSCTL_CPU_LP_HALT_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_HALT_MASK) >> SYSCTL_CPU_LP_HALT_SHIFT)

/*
 * WAKE (RO)
 *
 * CPU0 is waking up
 * 0: CPU0 wake up not asserted
 * 1: CPU0 wake up asserted
 */
#define SYSCTL_CPU_LP_WAKE_MASK (0x2000U)
#define SYSCTL_CPU_LP_WAKE_SHIFT (13U)
#define SYSCTL_CPU_LP_WAKE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_WAKE_MASK) >> SYSCTL_CPU_LP_WAKE_SHIFT)

/*
 * EXEC (RO)
 *
 * CPU0 is executing
 * 0: CPU0 is not executing
 * 1: CPU0 is executing
 */
#define SYSCTL_CPU_LP_EXEC_MASK (0x1000U)
#define SYSCTL_CPU_LP_EXEC_SHIFT (12U)
#define SYSCTL_CPU_LP_EXEC_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_EXEC_MASK) >> SYSCTL_CPU_LP_EXEC_SHIFT)

/*
 * WAKE_FLAG (RW)
 *
 * CPU0 wakeup flag, indicate a wakeup event got active, write 1 to clear this bit
 * 0: CPU0 wakeup not happened
 * 1: CPU0 wake up happened
 */
#define SYSCTL_CPU_LP_WAKE_FLAG_MASK (0x400U)
#define SYSCTL_CPU_LP_WAKE_FLAG_SHIFT (10U)
#define SYSCTL_CPU_LP_WAKE_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_WAKE_FLAG_SHIFT) & SYSCTL_CPU_LP_WAKE_FLAG_MASK)
#define SYSCTL_CPU_LP_WAKE_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_WAKE_FLAG_MASK) >> SYSCTL_CPU_LP_WAKE_FLAG_SHIFT)

/*
 * SLEEP_FLAG (RW)
 *
 * CPU0 sleep flag, indicate a sleep event got active, write 1 to clear this bit
 * 0: CPU0 sleep not happened
 * 1: CPU0 sleep happened
 */
#define SYSCTL_CPU_LP_SLEEP_FLAG_MASK (0x200U)
#define SYSCTL_CPU_LP_SLEEP_FLAG_SHIFT (9U)
#define SYSCTL_CPU_LP_SLEEP_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_SLEEP_FLAG_SHIFT) & SYSCTL_CPU_LP_SLEEP_FLAG_MASK)
#define SYSCTL_CPU_LP_SLEEP_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_SLEEP_FLAG_MASK) >> SYSCTL_CPU_LP_SLEEP_FLAG_SHIFT)

/*
 * RESET_FLAG (RW)
 *
 * CPU0 reset flag, indicate a reset event got active, write 1 to clear this bit
 * 0: CPU0 reset not happened
 * 1: CPU0 reset happened
 */
#define SYSCTL_CPU_LP_RESET_FLAG_MASK (0x100U)
#define SYSCTL_CPU_LP_RESET_FLAG_SHIFT (8U)
#define SYSCTL_CPU_LP_RESET_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_RESET_FLAG_SHIFT) & SYSCTL_CPU_LP_RESET_FLAG_MASK)
#define SYSCTL_CPU_LP_RESET_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_RESET_FLAG_MASK) >> SYSCTL_CPU_LP_RESET_FLAG_SHIFT)

/*
 * MODE (RW)
 *
 * Low power mode, system behavior after WFI
 * 00: CPU clock stop after WFI
 * 01: System enter low power mode after WFI
 * 10: Keep running after WFI
 * 11: reserved
 */
#define SYSCTL_CPU_LP_MODE_MASK (0x3U)
#define SYSCTL_CPU_LP_MODE_SHIFT (0U)
#define SYSCTL_CPU_LP_MODE_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_MODE_SHIFT) & SYSCTL_CPU_LP_MODE_MASK)
#define SYSCTL_CPU_LP_MODE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_MODE_MASK) >> SYSCTL_CPU_LP_MODE_SHIFT)

/* Bitfield definition for register of struct array CPU: LOCK */
/*
 * GPR (RW)
 *
 * Lock bit for CPU_DATA0 to CPU_DATA13, once set, this bit will not clear untile next reset
 */
#define SYSCTL_CPU_LOCK_GPR_MASK (0xFFFCU)
#define SYSCTL_CPU_LOCK_GPR_SHIFT (2U)
#define SYSCTL_CPU_LOCK_GPR_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LOCK_GPR_SHIFT) & SYSCTL_CPU_LOCK_GPR_MASK)
#define SYSCTL_CPU_LOCK_GPR_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LOCK_GPR_MASK) >> SYSCTL_CPU_LOCK_GPR_SHIFT)

/*
 * LOCK (RW)
 *
 * Lock bit for CPU_LOCK
 */
#define SYSCTL_CPU_LOCK_LOCK_MASK (0x2U)
#define SYSCTL_CPU_LOCK_LOCK_SHIFT (1U)
#define SYSCTL_CPU_LOCK_LOCK_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LOCK_LOCK_SHIFT) & SYSCTL_CPU_LOCK_LOCK_MASK)
#define SYSCTL_CPU_LOCK_LOCK_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LOCK_LOCK_MASK) >> SYSCTL_CPU_LOCK_LOCK_SHIFT)

/* Bitfield definition for register of struct array CPU: GPR0 */
/*
 * GPR (RW)
 *
 * register for software to handle resume, can save resume address or status
 */
#define SYSCTL_CPU_GPR_GPR_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_GPR_GPR_SHIFT (0U)
#define SYSCTL_CPU_GPR_GPR_SET(x) (((uint32_t)(x) << SYSCTL_CPU_GPR_GPR_SHIFT) & SYSCTL_CPU_GPR_GPR_MASK)
#define SYSCTL_CPU_GPR_GPR_GET(x) (((uint32_t)(x) & SYSCTL_CPU_GPR_GPR_MASK) >> SYSCTL_CPU_GPR_GPR_SHIFT)

/* Bitfield definition for register of struct array CPU: STATUS0 */
/*
 * STATUS (RO)
 *
 * IRQ values
 */
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_SHIFT (0U)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_GET(x) (((uint32_t)(x) & SYSCTL_CPU_WAKEUP_STATUS_STATUS_MASK) >> SYSCTL_CPU_WAKEUP_STATUS_STATUS_SHIFT)

/* Bitfield definition for register of struct array CPU: ENABLE0 */
/*
 * ENABLE (RW)
 *
 * IRQ wakeup enable
 */
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT (0U)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SET(x) (((uint32_t)(x) << SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT) & SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK) >> SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT)



/* RESOURCE register group index macro definition */
#define SYSCTL_RESOURCE_CPU0 (0UL)
#define SYSCTL_RESOURCE_CPX0 (1UL)
#define SYSCTL_RESOURCE_CPU1 (8UL)
#define SYSCTL_RESOURCE_CPX1 (9UL)
#define SYSCTL_RESOURCE_POW_CPU0 (21UL)
#define SYSCTL_RESOURCE_POW_CPU1 (22UL)
#define SYSCTL_RESOURCE_RST_SOC (23UL)
#define SYSCTL_RESOURCE_RST_CPU0 (24UL)
#define SYSCTL_RESOURCE_RST_CPU1 (25UL)
#define SYSCTL_RESOURCE_CLK_SRC_XTAL (32UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL0 (33UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL0 (34UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL0 (35UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK2_PLL0 (36UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1 (37UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL1 (38UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL1 (39UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL2 (40UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL2 (41UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL2 (42UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL0_REF (43UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1_REF (44UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL2_REF (45UL)
#define SYSCTL_RESOURCE_CLK_TOP_CPU0 (64UL)
#define SYSCTL_RESOURCE_CLK_TOP_MCT0 (65UL)
#define SYSCTL_RESOURCE_CLK_TOP_MCT1 (66UL)
#define SYSCTL_RESOURCE_CLK_TOP_XPI0 (67UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR0 (68UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR1 (69UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR2 (70UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR3 (71UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT0 (72UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT1 (73UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT2 (74UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT3 (75UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT4 (76UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT5 (77UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT6 (78UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT7 (79UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C0 (80UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C1 (81UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C2 (82UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C3 (83UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI0 (84UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI1 (85UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI2 (86UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI3 (87UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN0 (88UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN1 (89UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN2 (90UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN3 (91UL)
#define SYSCTL_RESOURCE_CLK_TOP_PTPC (92UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA0 (93UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA1 (94UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA2 (95UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA3 (96UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA4 (97UL)
#define SYSCTL_RESOURCE_CLK_TOP_REF0 (98UL)
#define SYSCTL_RESOURCE_CLK_TOP_REF1 (99UL)
#define SYSCTL_RESOURCE_CLK_TOP_LIN0 (100UL)
#define SYSCTL_RESOURCE_CLK_TOP_LIN1 (101UL)
#define SYSCTL_RESOURCE_CLK_TOP_LIN2 (102UL)
#define SYSCTL_RESOURCE_CLK_TOP_LIN3 (103UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC0 (128UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC1 (129UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC2 (130UL)
#define SYSCTL_RESOURCE_CLK_TOP_DAC0 (131UL)
#define SYSCTL_RESOURCE_CLK_TOP_DAC1 (132UL)
#define SYSCTL_RESOURCE_AHBP (256UL)
#define SYSCTL_RESOURCE_AXIS (257UL)
#define SYSCTL_RESOURCE_AXIC (258UL)
#define SYSCTL_RESOURCE_LMM0 (259UL)
#define SYSCTL_RESOURCE_MCT0 (260UL)
#define SYSCTL_RESOURCE_LMM1 (261UL)
#define SYSCTL_RESOURCE_MCT1 (262UL)
#define SYSCTL_RESOURCE_ROM0 (263UL)
#define SYSCTL_RESOURCE_RAM0 (264UL)
#define SYSCTL_RESOURCE_I2C0 (265UL)
#define SYSCTL_RESOURCE_I2C1 (266UL)
#define SYSCTL_RESOURCE_I2C2 (267UL)
#define SYSCTL_RESOURCE_I2C3 (268UL)
#define SYSCTL_RESOURCE_TMR0 (269UL)
#define SYSCTL_RESOURCE_TMR1 (270UL)
#define SYSCTL_RESOURCE_TMR2 (271UL)
#define SYSCTL_RESOURCE_TMR3 (272UL)
#define SYSCTL_RESOURCE_GPIO (273UL)
#define SYSCTL_RESOURCE_ADC0 (274UL)
#define SYSCTL_RESOURCE_ADC1 (275UL)
#define SYSCTL_RESOURCE_ADC2 (276UL)
#define SYSCTL_RESOURCE_DAC0 (277UL)
#define SYSCTL_RESOURCE_DAC1 (278UL)
#define SYSCTL_RESOURCE_ACMP (279UL)
#define SYSCTL_RESOURCE_SPI0 (280UL)
#define SYSCTL_RESOURCE_SPI1 (281UL)
#define SYSCTL_RESOURCE_SPI2 (282UL)
#define SYSCTL_RESOURCE_SPI3 (283UL)
#define SYSCTL_RESOURCE_SDM0 (284UL)
#define SYSCTL_RESOURCE_URT0 (285UL)
#define SYSCTL_RESOURCE_URT1 (286UL)
#define SYSCTL_RESOURCE_URT2 (287UL)
#define SYSCTL_RESOURCE_URT3 (288UL)
#define SYSCTL_RESOURCE_URT4 (289UL)
#define SYSCTL_RESOURCE_URT5 (290UL)
#define SYSCTL_RESOURCE_URT6 (291UL)
#define SYSCTL_RESOURCE_URT7 (292UL)
#define SYSCTL_RESOURCE_LIN0 (293UL)
#define SYSCTL_RESOURCE_LIN1 (294UL)
#define SYSCTL_RESOURCE_LIN2 (295UL)
#define SYSCTL_RESOURCE_LIN3 (296UL)
#define SYSCTL_RESOURCE_PTPC (297UL)
#define SYSCTL_RESOURCE_CAN0 (298UL)
#define SYSCTL_RESOURCE_CAN1 (299UL)
#define SYSCTL_RESOURCE_CAN2 (300UL)
#define SYSCTL_RESOURCE_CAN3 (301UL)
#define SYSCTL_RESOURCE_WDG0 (302UL)
#define SYSCTL_RESOURCE_WDG1 (303UL)
#define SYSCTL_RESOURCE_MBX0 (304UL)
#define SYSCTL_RESOURCE_MBX1 (305UL)
#define SYSCTL_RESOURCE_CRC0 (306UL)
#define SYSCTL_RESOURCE_MOT0 (307UL)
#define SYSCTL_RESOURCE_MOT1 (308UL)
#define SYSCTL_RESOURCE_MOT2 (309UL)
#define SYSCTL_RESOURCE_MOT3 (310UL)
#define SYSCTL_RESOURCE_MSYN (311UL)
#define SYSCTL_RESOURCE_XPI0 (312UL)
#define SYSCTL_RESOURCE_HDMA (313UL)
#define SYSCTL_RESOURCE_XDMA (314UL)
#define SYSCTL_RESOURCE_KMAN (315UL)
#define SYSCTL_RESOURCE_SDP0 (316UL)
#define SYSCTL_RESOURCE_RNG0 (317UL)
#define SYSCTL_RESOURCE_TSNS (318UL)
#define SYSCTL_RESOURCE_USB0 (319UL)
#define SYSCTL_RESOURCE_REF0 (320UL)
#define SYSCTL_RESOURCE_REF1 (321UL)

/* GROUP0 register group index macro definition */
#define SYSCTL_GROUP0_LINK0 (0UL)
#define SYSCTL_GROUP0_LINK1 (1UL)
#define SYSCTL_GROUP0_LINK2 (2UL)

/* GROUP1 register group index macro definition */
#define SYSCTL_GROUP1_LINK0 (0UL)
#define SYSCTL_GROUP1_LINK1 (1UL)
#define SYSCTL_GROUP1_LINK2 (2UL)

/* AFFILIATE register group index macro definition */
#define SYSCTL_AFFILIATE_CPU0 (0UL)
#define SYSCTL_AFFILIATE_CPU1 (1UL)

